<template>
  <div class="main">
    <div class="q-pa-lg row headerbar justify-center">
      <q-btn flat>رزومه ها</q-btn>
      <q-btn flat>پلن ها</q-btn>
      <q-btn flat class="bg-indigo-5 text-white" :to="{name:'main'}">خانه</q-btn>
      <q-btn flat :to="{path:'project'}">داشبورد</q-btn>
      <q-btn flat>خروج</q-btn>
    </div>
    <div class="container">
      <div class="q-mt-md" v-for="(post,index) in posts" :key="index">
        <q-card flat bordered>
          <q-card-section class="row bg-indigo-5">
            <div class="text-h6 text-white">{{post.title}}</div>
            <q-space/>
            <q-rating
              name="quality"
              v-model="quality"
              max="5"
              size="1.5em"
              color="white"
              icon="star_border"
              icon-selected="star"
              no-dimming
            />
          </q-card-section>
          <q-expansion-item
            style="border-radius: 30px"
            expand-separator
            icon="perm_identity"
            :label="post.author"
            :caption="post.caption"
          >
            <q-card>

              <q-card-section style=";opacity:0.9"
                              v-html="post.description"
                              class="text-grey-8"/>
            </q-card>
          </q-expansion-item>
          <q-separator/>
        </q-card>
      </div>
    </div>
  </div>
</template>

<script>
  export default {
    name: "Blog",
    data() {
      return {
        posts: [
          {
            title:  'مدیریت پسماند های سازمانی! ',
            description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.',
            author: 'عرفان چگینی',
            caption: 'مدیر شرکت تاژ'
          },
          {
            title:  'اسکرام و من',
            description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.',
            author: 'میلاد عبداللهی',
            caption: 'مدیر شرکت گلرنگ'
          },
          {
            title:  'راهکار های مدیریت بحران',
            description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.',
            author: 'مهدی خان محمدی',
            caption: 'مدیر شرکت رادین'
          }
        ],
        quality: 3,
        text: 'در ایین مقاله سعی میکنم شمارا با جدیدترین تجربیاتم آشنا کنم. این تجربیات بسیار احمانه و پوچند و صرفا جنبه تبلیغاتی دارند.لطفا در صورت ایراد املایی و نگارشی آرامش خود را حفظ کنید و عصبی بمانید.این یک متن عادی نیست این متن ساختگی ترین متن تاریخی است'
      }
    }
  }
</script>

<style scoped>
  .container {
    margin-right: auto;
    margin-left: auto;
  }

  .main::after {
    content: "";
    background: url("../assets/bg_1.jpg");
    background-repeat: no-repeat;
    background-size: cover;
    opacity: 0.4;
    top: 0px;
    left: 0;
    bottom: 0;
    right: 0;
    position: absolute;
    z-index: -1;
    height: 120%;
  }

  @media (min-width: 768px) {
    .container {
      width: 750px;
    }
  }

  @media (min-width: 992px) {
    .container {
      width: 970px;
    }
  }

  @media (min-width: 1200px) {
    .container {
      width: 850px;
    }
  }
</style>
